// S_ONEC_061 Стиль написания ключевых слов x1
перем Значение;
// S_ONEC_061 Стиль написания ключевых слов x1
перем Значение Экспорт;
// S_ONEC_061 Стиль написания ключевых слов x1
перем Значение1, Значение2, Значение3;

// S_ONEC_061 Стиль написания ключевых слов x1
пЕрЕм Значение;
// S_ONEC_061 Стиль написания ключевых слов x1
пЕрЕм Значение Экспорт;
// S_ONEC_061 Стиль написания ключевых слов x1
пЕрЕм Значение1, Значение2, Значение3;

// S_ONEC_061 Стиль написания ключевых слов x1
ПЕРЕМ Значение;
// S_ONEC_061 Стиль написания ключевых слов x1
ПЕРЕМ Значение Экспорт;
// S_ONEC_061 Стиль написания ключевых слов x1
ПЕРЕМ Значение1, Значение2, Значение3;
