//-- NavigationLinkClick.bsl
&НаКлиенте
Процедура СсылкаНаДокументОткрытие(Элемент, СтандартнаяОбработка)
    НавСсылка = Элемент.ТекстРедактирования;
    СсылкаНаДокумент = УзнатьНавигационнуюСсылка(НавСсылка);

    Попытка
        // S_ONEC_029 Переход по навигационной ссылке x1
        ПерейтиПоНавигационнойСсылке(СсылкаНаДокумент);
    Исключение
        СообщениеПользователю.Текст = "Ошибка!";
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщениепользователю.Сообщить();
    КонецПопытки;
КонецПроцедуры
//== NavigationLinkClick.bsl