//-- HardcodedPassword.bsl
Процедура HardcodedPassword()
    Перем пароль;

    // S_ONEC_021 Явно заданное значение пароля x1
    парОль = "Secret";
    парОль = пароль;
    // S_ONEC_021 Явно заданное значение пароля x1
    прл = "12345";
    // S_ONEC_021 Явно заданное значение пароля x1
    password = "12345";
    // S_ONEC_021 Явно заданное значение пароля x1
    passWD = "12345";
    // S_ONEC_021 Явно заданное значение пароля x1
    paswd = 12345;
    // S_ONEC_021 Явно заданное значение пароля x1
    psWord = 12345.34;
    // S_ONEC_021 Явно заданное значение пароля x1
    pswd = "12345";
    // S_ONEC_021 Явно заданное значение пароля x1
    PWD = "12345";
    // S_ONEC_021 Явно заданное значение пароля x1
    pword = "12345";
    // S_ONEC_021 Явно заданное значение пароля x1
    Профиль.ПарольSMTP = "222222";
    Профиль.ПарольSMTP = пароль;

    // S_ONEC_061 Стиль написания ключевых слов x1
    Профиль = новый ИнтернетПочтовыйПрофиль;
    Профиль.АдресСервераSMTP = "smtp.yandex.ru";
    Профиль.ПользовательSMTP = "111";

    Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
КонецПроцедуры
//== HardcodedPassword.bsl
