Процедура ЗаписатьДанныеВИБ()

    Попытка
        // S_ONEC_050 Открытие транзакции внутри блока Попытка-Исключение x1
        // S_ONEC_051 Фиксация транзакции внутри блока Попытка-Исключение x1
        НачатьТранзакцию(); // ! BeginTransaction flaw
        // чтение или запись данных
        ЗафиксироватьТранзакцию(); // ! EndTransaction flaw

        // S_ONEC_050 Открытие транзакции внутри блока Попытка-Исключение x1
        // S_ONEC_051 Фиксация транзакции внутри блока Попытка-Исключение x1
        BeginTransaction(); // ! BeginTransaction flaw
        // чтение или запись данных
        CommitTransaction(); // ! EndTransaction flaw

        ДокументОбъект.Записать();
    Исключение
        ОтменитьТранзакцию();
        // дополнительные действия по обработке исключения
    КонецПопытки;

    НачатьТранзакцию();
    ЗафиксироватьТранзакцию(); // ! EndTransaction flaw

    BeginTransaction();
    CommitTransaction(); // ! EndTransaction flaw

КонецПроцедуры