//-- SavedPasswordValue.bsl
Функция ПроверитьТекущийПарольПользователя(Пароль, РегистроНеза=Истина) Экспорт
    // S_ONEC_002 Привилегированный режим 1С x1
    УстановитьПривилегированныйРежим(Истина);
    // Доступ к свойству «СохраняемоеЗначениеПароля»
    // S_ONEC_006 Доступ к свойству «СохраняемоеЗначениеПароля» x1
    ХешТекущегоПароля = ПользователиИнформационнойБазы.ТекущийПользователь().СохраняемоеЗначениеПароля;
    УстановитьПривилегированныйРежим(Ложь);
КонецФункции
//== SavedPasswordValue.bsl
