//-- PrivilegedMod.bsl
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСпособДоставки(Рассылка, Знач ПараметрыДоставки) Экспорт
    // S_ONEC_002 Привилегированный режим 1С x1
    УстановитьПривилегированныйРежим(Истина);
        Попытка
            ShellApplication.SetTime();
        Исключение
            ПараметрыЖурнала.Вставить("Данные",  Рассылка);
        КонецПопытки;
    // S_ONEC_061 Стиль написания ключевых слов x1
        возврат ПараметрыЖурнала;
    УстановитьПривилегированныйРежим(Ложь);

    // S_ONEC_061 Стиль написания ключевых слов x1
    Для НазваниеПерем = СчетчНачало по СчетчКонец Цикл
        Если 1 < 0 Тогда
            // S_ONEC_002 Привилегированный режим 1С x1
            УстановитьПривилегированныйРежим(Истина);
            УстановитьПривилегированныйРежим(Ложь);
        Иначе
    // S_ONEC_061 Стиль написания ключевых слов x1
            Для н = 1 по 100 Цикл
                // Привилегированный режим
                // S_ONEC_002 Привилегированный режим 1С x1
                УстановитьПривилегированныйРежим(Истина);
                // S_ONEC_052 Устаревший метод «Сообщить» x1
                Сообщить("Команда выполняется в привилегированном режиме !");
                УстановитьПривилегированныйРежим(Ложь);
            КонецЦикла;
                // Привилегированный режим
                // Некорректная деактивация привилегированного режима
                // S_ONEC_002 Привилегированный режим 1С x1
                // S_ONEC_003 Некорректная деактивация привилегированного режима x1
                УстановитьПривилегированныйРежим(Истина);
                // S_ONEC_052 Устаревший метод «Сообщить» x1
                Сообщить("Команда выполняется в привилегированном режиме !");
        КонецЕсли;

        // Привилегированный режим
        // Некорректная деактивация привилегированного режима
        // S_ONEC_002 Привилегированный режим 1С x1
        // S_ONEC_003 Некорректная деактивация привилегированного режима x1
        УстановитьПривилегированныйРежим(Истина);
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Команда выполняется в привилегированном режиме !");
    КонецЦикла;
КонецФункции
//== PrivilegedMod.bsl
