// S_ONEC_061 Стиль написания ключевых слов x1
raise;
// S_ONEC_061 Стиль написания ключевых слов x1
raise "";
// S_ONEC_061 Стиль написания ключевых слов x1
raise ("", КатегорияОшибки.ОшибкаКонфигурации);

// S_ONEC_061 Стиль написания ключевых слов x1
rAiSe;
// S_ONEC_061 Стиль написания ключевых слов x1
rAiSe "";
// S_ONEC_061 Стиль написания ключевых слов x1
rAiSe ("", КатегорияОшибки.ОшибкаКонфигурации);

// S_ONEC_061 Стиль написания ключевых слов x1
RaIsE;
// S_ONEC_061 Стиль написания ключевых слов x1
RaIsE "";
// S_ONEC_061 Стиль написания ключевых слов x1
RaIsE ("", КатегорияОшибки.ОшибкаКонфигурации);

// S_ONEC_061 Стиль написания ключевых слов x1
RAISE;
// S_ONEC_061 Стиль написания ключевых слов x1
RAISE "";
// S_ONEC_061 Стиль написания ключевых слов x1
RAISE ("", КатегорияОшибки.ОшибкаКонфигурации);
