//-- EmptyOperator-onlySemicolon.bsl

Процедура Пример1()
    Для Каждого СтрокаТовары Из Товары Цикл
    // S_ONEC_060 Пустой оператор x1
        ;                                                           //Пустой оператор
    КонецЦикла;
КонецПроцедуры


Процедура Пример2()
    Для Каждого СтрокаТовары Из Товары Цикл
        // S_ONEC_060 Пустой оператор x1
        ;                                                           //Пустой оператор
        Движение = Движения.СвободныеОстатки.Добавить();
    КонецЦикла;
КонецПроцедуры

Функция ПримерВозврат()
    // S_ONEC_060 Пустой оператор x1
    ;						                                        //Пустой оператор
    Возврат 42;
КонецФункции

Процедура Пример3()
    // S_ONEC_060 Пустой оператор x1
    ;						                                        //Пустой оператор
    Если 1 = 1 Тогда
	    // S_ONEC_060 Пустой оператор x1
	    ;					                                        //Пустой оператор
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Условие выполнено");
    Иначе
	    // S_ONEC_060 Пустой оператор x2
	    ;;					                                        //Пустой оператор x2
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Условие не выполнено");
    КонецЕсли;
КонецПроцедуры


Функция ПримерВозврат()
    // S_ONEC_060 Пустой оператор x1
    ;						                                        //Пустой оператор
КонецФункции

//== EmptyOperator-onlySemicolon.bsl
