// S_ONEC_061 Стиль написания ключевых слов x1
для Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
для i = 1 По 10 Цикл
    Обработать(i);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
дЛя Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
дЛя i = 1 По 10 Цикл
    Обработать(i);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
ДЛЯ Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
ДЛЯ i = 1 По 10 Цикл
    Обработать(i);
КонецЦикла;
