//-- Find.bsl\

Функция СотрудникПоФамилии()
    ИскомаяФамилия = "Петров";
    СписокСотрудников = Справочники.Сотрудники;

    // S_ONEC_061 Стиль написания ключевых слов x1
    Для Каждого Сотрудник из СписокСотрудников цикл
        // S_ONEC_046 Использование функции «Найти» x1
        Если Найти(Сотрудник.Имя,ИскомаяФамилия) > 0 Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;

    Возврат Ложь;
КонецФункции


Функция СотрудникПоФамилии()
    ИскомаяФамилия = "Петров";
    СписокСотрудников = Справочники.Сотрудники;

    // S_ONEC_061 Стиль написания ключевых слов x1
    Для Каждого Сотрудник из СписокСотрудников цикл
        Если СтрНайти(Сотрудник.Имя,ИскомаяФамилия) > 0 Тогда
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;

    Возврат Ложь;
КонецФункции


Процедура НайтиВалютуПоКоду()
    СтрокаКода = "840";
    Валюты = Справочники.Валюты;
    НайденнаяСсылка = Валюты.НайтиПоКоду(СтрокаКода);

    Если НайденнаяСсылка = Валюты.ПустаяСсылка() Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Валюты """ + СтрокаКода + """ еще нет");
    КонецЕсли;
// S_ONEC_060 Пустой оператор x1
КонецПроцедуры;

//== Find.bsl
