// S_ONEC_061 Стиль написания ключевых слов x1
вызватьИсключение;
// S_ONEC_061 Стиль написания ключевых слов x1
вызватьИсключение "";
// S_ONEC_061 Стиль написания ключевых слов x1
вызватьИсключение("", КатегорияОшибки.ОшибкаКонфигурации);

// S_ONEC_061 Стиль написания ключевых слов x1
Вызватьисключение;
// S_ONEC_061 Стиль написания ключевых слов x1
Вызватьисключение "";
// S_ONEC_061 Стиль написания ключевых слов x1
Вызватьисключение("", КатегорияОшибки.ОшибкаКонфигурации);

// S_ONEC_061 Стиль написания ключевых слов x1
вызватьисключение;
// S_ONEC_061 Стиль написания ключевых слов x1
вызватьисключение "";
// S_ONEC_061 Стиль написания ключевых слов x1
вызватьисключение("", КатегорияОшибки.ОшибкаКонфигурации);

// S_ONEC_061 Стиль написания ключевых слов x1
ВЫЗВАТЬИСКЛЮЧЕНИЕ;
// S_ONEC_061 Стиль написания ключевых слов x1
ВЫЗВАТЬИСКЛЮЧЕНИЕ "";
// S_ONEC_061 Стиль написания ключевых слов x1
ВЫЗВАТЬИСКЛЮЧЕНИЕ("", КатегорияОшибки.ОшибкаКонфигурации);
