Функция ПримерФункции(Коллекция)
    СписокСтудентов = ПолучитьСписокСтудентов();

    Для Каждого Студент Из СписокСтудентов Цикл
        СуммаБаллов = 0;
        Баллы = Студент.ПолучитьБаллы();

        Для Каждого Оценка Из Баллы Цикл
            СуммаБаллов = СуммаБаллов + Оценка;

            Если СуммаБаллов > 100 Тогда
                // S_ONEC_052 Устаревший метод «Сообщить» x1
                Сообщить("Слишком много баллов");
                // S_ONEC_056 Удаление элемента коллекции при итерировании x1
                СписокСтудентов.Удалить(Студент);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;

КонецФункции
