// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
Если Истина Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие выполнено");
// S_ONEC_061 Стиль написания ключевых слов x1
иначеЕсли Ложь Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Альтернативное условие");
// S_ONEC_061 Стиль написания ключевых слов x1
Иначеесли Ложь Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Альтернативное условие");
// S_ONEC_061 Стиль написания ключевых слов x1
иначеесли Ложь Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Альтернативное условие");
// S_ONEC_061 Стиль написания ключевых слов x1
ИНАЧЕЕСЛИ Ложь Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Альтернативное условие");
КонецЕсли;
