Процедура ЗаписатьДанныеВИБ()

    Попытка


        НачатьТранзакцию(); // ! BeginTransaction flaw
        // чтение или запись данных
        // S_ONEC_050 Открытие транзакции внутри блока Попытка-Исключение x1
        // S_ONEC_051 Фиксация транзакции внутри блока Попытка-Исключение x1
        ЗафиксироватьТранзакцию(); // ! EndTransaction flaw



        BeginTransaction(); // ! BeginTransaction flaw
        // чтение или запись данных
        // S_ONEC_050 Открытие транзакции внутри блока Попытка-Исключение x1
        // S_ONEC_051 Фиксация транзакции внутри блока Попытка-Исключение x1
        CommitTransaction(); // ! EndTransaction flaw

        ДокументОбъект.Записать();
    Исключение
        ОтменитьТранзакцию();
        // дополнительные действия по обработке исключения
    КонецПопытки;


    НачатьТранзакцию();
    // S_ONEC_050 Открытие транзакции внутри блока Попытка-Исключение x1
    // S_ONEC_051 Фиксация транзакции внутри блока Попытка-Исключение x1
    ЗафиксироватьТранзакцию(); // ! EndTransaction flaw


    BeginTransaction();
    // S_ONEC_050 Открытие транзакции внутри блока Попытка-Исключение x1
    // S_ONEC_051 Фиксация транзакции внутри блока Попытка-Исключение x1
    CommitTransaction(); // ! EndTransaction flaw

КонецПроцедуры