// S_ONEC_049 Доступ к файловой системе x1
Текст = Новый ЧтениеТекста(ПутьФайла, КодировкаТекста.ANSI);
// S_ONEC_049 Доступ к файловой системе x1
Текст = Новый ЗаписьТекста(ПутьФайла, КодировкаТекста.ANSI);

// S_ONEC_049 Доступ к файловой системе x1
ЗначениеВФайл(ПутьФайла, ЛичныеДанные);
// S_ONEC_049 Доступ к файловой системе x1
КопироватьФайл(ПутьФайла, ДругойПутьФайла);

МассивИмен = Новый Массив();
МассивИмен.Добавить(ПутьФайла);
// S_ONEC_049 Доступ к файловой системе x1
ОбъединитьФайлы(МассивИмен, ДругойПутьФайла);

// S_ONEC_049 Доступ к файловой системе x1
ПереместитьФайл(ПутьФайла, ДругойПутьФайла);
// S_ONEC_049 Доступ к файловой системе x1
РазделитьФайл(ПутьФайла, 1024 * 1024 );
// S_ONEC_049 Доступ к файловой системе x1
СоздатьКаталог(ИмяКаталога);
// S_ONEC_049 Доступ к файловой системе x1
УдалитьФайлы(ПутьФайла);