//-- HardcodedPassword.bsl
Процедура HardcodedPassword()
    Перем пароль;

    // S_ONEC_036 Присвоение паролю пустой строки x1
    парОль = "";
    // S_ONEC_036 Присвоение паролю пустой строки x1
    прл = "";
    // S_ONEC_036 Присвоение паролю пустой строки x1
    Профиль.ПарольSMTP = "";

    // S_ONEC_061 Стиль написания ключевых слов x1
    Профиль = новый ИнтернетПочтовыйПрофиль;
    Профиль.АдресСервераSMTP = "smtp.yandex.ru";
    Профиль.ПользовательSMTP = "111";

    Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
КонецПроцедуры
//== HardcodedPassword.bsl
