//-- HardcodedPassword.bsl
Процедура HardcodedPassword()
    Перем пароль;

    // S_ONEC_037 Присвоение паролю значения NULL x1
    password = Null;
    // S_ONEC_037 Присвоение паролю значения NULL x1
    // S_ONEC_061 Стиль написания ключевых слов x1
    passWD = nuLL;
    // S_ONEC_037 Присвоение паролю значения NULL x1
    // S_ONEC_061 Стиль написания ключевых слов x1
    Профиль.ПарольSMTP = NulL;

    // S_ONEC_061 Стиль написания ключевых слов x1
    Профиль = новый ИнтернетПочтовыйПрофиль;
    Профиль.АдресСервераSMTP = "smtp.yandex.ru";
    Профиль.ПользовательSMTP = "111";

    Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
КонецПроцедуры
//== HardcodedPassword.bsl
