//-- EmptyCatchBlock.bsl
&НаКлиенте
Процедура TryProc1()
    Попытка
        ВыполнитьОперацию();
    // S_ONEC_039 Пустой блок «Исключение» x1
    // S_ONEC_040 Пустой блок x1
    Исключение
    КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура TryProc2()
    Попытка
        ВыполнитьОперацию();
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Message("Done !");
    // S_ONEC_039 Пустой блок «Исключение» x1
    // S_ONEC_040 Пустой блок x1
    Исключение
    КонецПопытки;

    Попытка
        ВыполнитьОперацию();
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Message("Done !");
    Исключение
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Message("Failed!");
    КонецПопытки;
КонецПроцедуры
//== EmptyCatchBlock.bsl
