Процедура ЗаписатьДанныеВИБ()
    НачатьТранзакцию();
    BeginTransaction();

    Попытка
        Объект = НачатьТранзакцию(); // - Не отдельный стейтмент
        Объект = BeginTransaction(); // - Не отдельный стейтмент

        Объект = ЗафиксироватьТранзакцию(); // - Не отдельный стейтмент
        Объект = CommitTransaction(); // - Не отдельный стейтмент

        // чтение или запись данных
        ДокументОбъект.Записать();

        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        // дополнительные действия по обработке исключения

        НачатьТранзакцию(); // -
        BeginTransaction(); // -
    КонецПопытки;

    НачатьТранзакцию(); // -
    BeginTransaction(); // -
КонецПроцедуры