// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
If True then
    Обработать();
// S_ONEC_061 Стиль написания ключевых слов x1
ElsIf False then
    Обработать();
EndIf;

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
If True tHEn
    Обработать();
// S_ONEC_061 Стиль написания ключевых слов x1
ElsIf False tHEn
    Обработать();
EndIf;

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
If True THEN
    Обработать();
// S_ONEC_061 Стиль написания ключевых слов x1
ElsIf False THEN
    Обработать();
EndIf;
