//-- EmptyBlocks.bsl
// S_ONEC_040 Пустой блок x1
Процедура МояПроцедура(Пар1, Пар2, Пар3) Экспорт
КонецПроцедуры
// S_ONEC_040 Пустой блок x1
Функция МояФункция(Пар1, Пар2, Пар3) Экспорт
КонецФункции

Процедура МояПроцедура(Пар1, Пар2, Пар3) Экспорт
    // S_ONEC_040 Пустой блок x1
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
    Если ДеньНедели(ТекущаяДата()) = 6 Тогда
    // S_ONEC_040 Пустой блок x1
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
    ИначеЕсли ДеньНедели(ТекущаяДата()) = 7 Тогда
    // S_ONEC_040 Пустой блок x1
    Иначе
    КонецЕсли;

    // S_ONEC_061 Стиль написания ключевых слов x1
    Для ТекДень = 1 по ПоследнийДеньМесяца Цикл
        Состояние("Обрабатывается день: "+ ТекДень);
    КонецЦикла;

    Если Не Документ.Пустая() Тогда
    // S_ONEC_040 Пустой блок x1
    // S_ONEC_061 Стиль написания ключевых слов x1
        Для каждого СтрокаСостава из Документ.Состав Цикл
        КонецЦикла;
    КонецЕсли;

    Пока ВыборкаДок.Следующий() Цикл
        Состояние("Обрабатывается документ №" + ВыборкаДок.Номер);
    КонецЦикла;

    // S_ONEC_040 Пустой блок x1
    Попытка
    // S_ONEC_040 Пустой блок x1
    // S_ONEC_039 Пустой блок «Исключение» x1
    Исключение
    КонецПопытки;
КонецПроцедуры

Функция МояФункция1(Пар1, Пар2, Пар3) Экспорт
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
    Если ДеньНедели(ТекущаяДата()) = 6 Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Сегодня суббота.");
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
    ИначеЕсли ДеньНедели(ТекущаяДата()) = 7 Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Сегодня воскресенье.");
    Иначе
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Сегодня рабочий день.");
    КонецЕсли;

    // S_ONEC_061 Стиль написания ключевых слов x1
    // S_ONEC_040 Пустой блок x1
    Для ТекДень = 1 по ПоследнийДеньМесяца Цикл
    КонецЦикла;

    Если Не Документ.Пустая() Тогда
    // S_ONEC_061 Стиль написания ключевых слов x1
        Для каждого СтрокаСостава из Документ.Состав Цикл
            Состояние("Строка: " + Документ.Состав.Индекс(СтрокаСостава)+1);
        КонецЦикла;
    КонецЕсли;

    // S_ONEC_040 Пустой блок x1
    Пока ВыборкаДок.Следующий() Цикл
    КонецЦикла;

    Попытка
        Табл = Новый ComObject("Excel.Application");
    Исключение
        Предупреждение(ОписаниеОшибки());
        Возврат;
    КонецПопытки;

    // S_ONEC_040 Пустой блок x1
    Если УсловиеВыполнено(Отказ) Тогда
    КонецЕсли;
КонецФункции
//== EmptyBlocks.bsl
