// S_ONEC_061 Стиль написания ключевых слов x1
Перем Значение1 экспорт;
// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Перем Значение1 экспорт, Значение2 экспорт;

// S_ONEC_061 Стиль написания ключевых слов x1
Перем Значение1 эКсПоРт;
// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Перем Значение1 эКсПоРт, Значение2 эКсПоРт;

// S_ONEC_061 Стиль написания ключевых слов x1
Перем Значение1 ЭКСПОРТ;
// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Перем Значение1 ЭКСПОРТ, Значение2 ЭКСПОРТ;


// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции() экспорт
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры() экспорт
    Возврат;
КонецПроцедуры


// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции() эКсПоРт
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры() эКсПоРт
    Возврат;
КонецПроцедуры


// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции() ЭКСПОРТ
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры() ЭКСПОРТ
    Возврат;
КонецПроцедуры
