
Функция ДобавитьПолеФормы(ИмяПоля, Заголовок = Неопределено, ОбработчикПриИзменении = "", ОбработчикНачалоВыбора = "", ШиринаПоля,
      ЦветФона = Неопределено, ЦветФонаЗаголовка = Неопределено, Родитель = Неопределено, КартинкаШапки = Неопределено, ПутьКДанным = Неопределено,
      ТолькоПросмотрПоля = Ложь, СвязиПараметровВыбора = Неопределено)
// ...
КонецФункции

НовоеПоле = ДобавитьПолеФормы("СтараяЦена", НСтр("ru='Цена'"),,, 12, ЦветФона, ЦветЗаголовка, НоваяГруппа,,,Истина);
НовоеПоле.ЦветТекста = WebЦвета.Серый;
КонецФункции

&Вместо("КодВозвратаОшибкаДанных")
Функция ОТ_КодВозвратаОшибкаДанных()
	
	Возврат 10400;
	
КонецФункции

&Вместо("КодВозвратаОтказАвторизации")
Функция ОТ_КодВозвратаОтказАвторизации()	

      Connection = Новый COMОбъект("ADODB.Connection");    
	Возврат 10403;
	
КонецФункции