// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
Конеццикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 Цикл
    Обработать(i);
Конеццикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие Цикл
    Обработать();
Конеццикла;


// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
конецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 Цикл
    Обработать(i);
конецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие Цикл
    Обработать();
конецЦикла;


// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
конеццикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 Цикл
    Обработать(i);
конеццикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие Цикл
    Обработать();
конеццикла;


// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция Цикл
    Обработать(Элемент);
КОНЕЦЦИКЛА;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 Цикл
    Обработать(i);
КОНЕЦЦИКЛА;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие Цикл
    Обработать();
КОНЕЦЦИКЛА;
