Для Каждого Элемент Из Коллекция Цикл
    Если Элемент = 5 Тогда
        // S_ONEC_061 Стиль написания ключевых слов x1
        продолжить;
    КонецЕсли;
КонецЦикла;

Для Каждого Элемент Из Коллекция Цикл
    Если Элемент = 5 Тогда
        // S_ONEC_061 Стиль написания ключевых слов x1
        пРОдоЛЖить;
    КонецЕсли;
КонецЦикла;

Для Каждого Элемент Из Коллекция Цикл
    Если Элемент = 5 Тогда
        // S_ONEC_061 Стиль написания ключевых слов x1
        ПРОДОЛЖИТЬ;
    КонецЕсли;
КонецЦикла;
