//-- OSExecution.bsl
Процедура Метод()
    СтрокаКоманды = "";
    ТекущийКаталог = "";
    ДождатьсяЗавершения = Истина;
    ОписаниеОповещения = Неопределено;
    ПараметрыКоманды = Новый Структура;

    // S_ONEC_009 Выполнение команд операционной системы x1
    КомандаСистемы(СтрокаКоманды, ТекущийКаталог); // Выполнение команд ОС
    // S_ONEC_010 Запуск приложения операционной системы x1
    ЗапуститьПриложение(СтрокаКоманды, ТекущийКаталог); // Запуск приложения ОС
    // S_ONEC_010 Запуск приложения операционной системы x1
    ЗапуститьПриложение(СтрокаКоманды, ТекущийКаталог, Истина); // Запуск приложения ОС

    // S_ONEC_010 Запуск приложения операционной системы x1
    НачатьЗапускПриложения(ОписаниеОповещения, СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения); // Запуск приложения ОС

    // S_ONEC_029 Переход по навигационной ссылке x1
    ПерейтиПоНавигационнойСсылке(СтрокаКоманды); // есть замечание BSL
    ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаКоманды); // есть замечание BSL
    ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаКоманды, ОписаниеОповещения); // есть замечание BSL

    // S_ONEC_010 Запуск приложения операционной системы x1
    // S_ONEC_045 Хардкод IP адресов x1
    ФайловаяСистемаКлиент.ЗапуститьПрограмму("ping 127.0.0.1 -n 5", ПараметрыКоманды); // Запуск приложения ОС _2
    // S_ONEC_010 Запуск приложения операционной системы x1
    ФайловаяСистемаКлиент.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыКоманды); // Запуск приложения ОС _2
    // S_ONEC_010 Запуск приложения операционной системы x1
    ФайловаяСистема.ЗапуститьПрограмму(СтрокаКоманды); // Запуск приложения ОС _2
    // S_ONEC_010 Запуск приложения операционной системы x1
    ФайловаяСистема.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыКоманды); // Запуск приложения ОС _2

    // S_ONEC_010 Запуск приложения операционной системы x1
    ФайловаяСистемаКлиент.ОткрытьПроводник("C:\Users"); // Запуск приложения ОС _2
    // S_ONEC_010 Запуск приложения операционной системы x1
    ФайловаяСистемаКлиент.ОткрытьФайл(СтрокаКоманды); // Запуск приложения ОС _2
    // S_ONEC_010 Запуск приложения операционной системы x1
    ФайловаяСистемаКлиент.ОткрытьФайл(СтрокаКоманды, ОписаниеОповещения); // Запуск приложения ОС _2

КонецПроцедуры

&НаКлиенте
Асинх Процедура Подключить()
    СтрокаКоманды = "";
    ТекущийКаталог = "";
    ДождатьсяЗавершения = Истина;

    // S_ONEC_010 Запуск приложения операционной системы x1
    Ждать ЗапуститьПриложениеАсинх(СтрокаКоманды, ТекущийКаталог, ДождатьсяЗавершения); // Запуск приложения ОС
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки, КодВозврата)
    ДождатьсяЗавершения = Истина;

    // S_ONEC_009 Выполнение команд операционной системы x1
    ЗапуститьСистему(); // Выполнение команд ОС
    // S_ONEC_009 Выполнение команд операционной системы x1
    ЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки); // Выполнение команд ОС
    // S_ONEC_009 Выполнение команд операционной системы x1
    ЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки, ДождатьсяЗавершения); // Выполнение команд ОС
    // S_ONEC_009 Выполнение команд операционной системы x1
    ЗапуститьСистему(ДополнительныеПараметрыКоманднойСтроки, ДождатьсяЗавершения, КодВозврата); // Выполнение команд ОС
КонецПроцедуры
//== OSExecution.bsl
