//-- IPCode.bsl

Функция ПроверкаПодключаемогоIP()
	СписокАдресов = Перечисления.СписокАдресовIP;
	// S_ONEC_045 Хардкод IP адресов x1
	АйпиАдрес = "100.8.1.100";

	// S_ONEC_061 Стиль написания ключевых слов x1
	Для каждого Адрес из СписокАдресов цикл
		Если Адрес = АйпиАдрес Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции


Функция ПроверкаПодключаемогоIP()
	СписокАдресов = Перечисления.СписокАдресовIP;
	// S_ONEC_045 Хардкод IP адресов x1
	АйпиАдрес = "100.40.134.200";

	// S_ONEC_061 Стиль написания ключевых слов x1
	Для каждого Адрес из СписокАдресов цикл
		Если Адрес = АйпиАдрес Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

Функция ПроверкаПодключаемогоIP()
	СписокАдресов = Перечисления.СписокАдресовIP;
	// S_ONEC_045 Хардкод IP адресов x1
	АйпиАдрес = "100.100.100.100";

	// S_ONEC_061 Стиль написания ключевых слов x1
	Для каждого Адрес из СписокАдресов цикл
		Если Адрес = АйпиАдрес Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

Функция ПроверкаПодключаемогоIP()
	СписокАдресов = Перечисления.СписокАдресовIP;
	// S_ONEC_045 Хардкод IP адресов x1
	АйпиАдрес = "5.45.10.100";

	// S_ONEC_061 Стиль написания ключевых слов x1
	Для каждого Адрес из СписокАдресов цикл
		Если Адрес = АйпиАдрес Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

//== IPCode.bsl
