Процедура ПроверкаСтиля()

    // S_ONEC_061 Стиль написания ключевых слов x1
    Значение = истина;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Значение = иСтиНа;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Значение = ИСТИНА;

    // S_ONEC_061 Стиль написания ключевых слов x1
    // S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
    // S_ONEC_035 Сравнение с булевым литералом x1
    Если Значение <> истина Тогда
        Обработать();
    // S_ONEC_061 Стиль написания ключевых слов x1
    ИначеЕсли истина Тогда
        Обработать();
    КонецЕсли;

    // S_ONEC_061 Стиль написания ключевых слов x1
    ПроверитьЗначение(истина);

КонецПроцедуры
