Procedure ПроверкаСтиля()

    // S_ONEC_061 Стиль написания ключевых слов x1
    Value = true;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Value = tRuE;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Value = TRUE;

    // S_ONEC_061 Стиль написания ключевых слов x1
    // S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
    // S_ONEC_035 Сравнение с булевым литералом x1
    If Value <> true Then
        Обработать();
    // S_ONEC_061 Стиль написания ключевых слов x1
    ElsIf true Then
        Обработать();
    EndIf;

    // S_ONEC_061 Стиль написания ключевых слов x1
    ПроверитьЗначение(true);

EndProcedure
