// S_ONEC_061 Стиль написания ключевых слов x1
Объект = новый ТипОбъекта;
// S_ONEC_061 Стиль написания ключевых слов x1
Объект = новый Массив(3);
// S_ONEC_061 Стиль написания ключевых слов x1
Объект = новый(ТипЗначения, Параметры);

// S_ONEC_061 Стиль написания ключевых слов x1
Объект = нОВыЙ ТипОбъекта;
// S_ONEC_061 Стиль написания ключевых слов x1
Объект = нОВыЙ Массив(3);
// S_ONEC_061 Стиль написания ключевых слов x1
Объект = нОВыЙ(ТипЗначения, Параметры);

// S_ONEC_061 Стиль написания ключевых слов x1
Объект = НОВЫЙ ТипОбъекта;
// S_ONEC_061 Стиль написания ключевых слов x1
Объект = НОВЫЙ Массив(3);
// S_ONEC_061 Стиль написания ключевых слов x1
Объект = НОВЫЙ(ТипЗначения, Параметры);
