//-- EmptyOperator.bsl

Процедура Пример()
// S_ONEC_060 Пустой оператор x1
    Если 1 = 1 Тогда
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Условие выполнено");;		                                //Пустой оператор
    Иначе
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Условие не выполнено");;		                            //Пустой оператор
    // S_ONEC_060 Пустой оператор x1
    КонецЕсли;;					                                            //Пустой оператор

    Для Счетчик = 1 По 3 Цикл
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Итерация: " + Строка(Счетчик));;	                        //Пустой оператор
    // S_ONEC_060 Пустой оператор x1
    КонецЦикла;;					                                        //Пустой оператор

    Счетчик = 1;
    Пока Счетчик <= 3 Цикл
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Итерация: " + Строка(Счетчик));;	                        //Пустой оператор
        // S_ONEC_060 Пустой оператор x1
        Счетчик = Счетчик + 1;;			                                    //Пустой оператор
    // S_ONEC_060_Пустой оператор x7
    КонецЦикла;;;;;;;;				                                        //Пустой оператор x7

    Для Счетчик = 1 По 5 Цикл
        Если Счетчик = 3 Тогда
            // S_ONEC_060 Пустой оператор x1
            Продолжить;;				                                    //Пустой оператор
        // S_ONEC_060 Пустой оператор x1
        КонецЕсли;;					                                        //Пустой оператор
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Итерация: " + Строка(Счетчик));;	                        //Пустой оператор
    // S_ONEC_060 Пустой оператор x1
    КонецЦикла;;					                                        //Пустой оператор

    Для Счетчик = 1 По 5 Цикл
        Если Счетчик = 3 Тогда
            // S_ONEC_060 Пустой оператор x1
            Прервать;;				                                        //Пустой оператор
        // S_ONEC_060 Пустой оператор x1
        КонецЕсли;;					                                        //Пустой оператор
            // S_ONEC 060_Пустой оператор x3
            // S_ONEC_052 Устаревший метод «Сообщить» x1
            Сообщить("Итерация: " + Строка(Счетчик));;;;                    //Пустой оператор x3
    // S_ONEC_060 Пустой оператор x2
    КонецЦикла;;;					                                        //Пустой оператор x2
    // S_ONEC_060 Пустой оператор x2
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Начало процедуры");;;		                                    //Пустой оператор x2
    // S_ONEC 060_Пустой оператор x3
    Выйти;;;;					                                            //Пустой оператор x3
    // S_ONEC 060_Пустой оператор x3
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Это сообщение не будет показано");;;;                         //Пустой оператор x3
КонецПроцедуры

Функция ПримерВозврат()
    // S_ONEC_060 Пустой оператор x2
    Возврат 42;;;				                                            //Пустой оператор x2
КонецФункции

Процедура Пример2()
    Попытка
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Попытка");;			                                    //Пустой оператор
        // S_ONEC_060 Пустой оператор x1
        ВызватьИсключение "Исключение";;		                            //Пустой оператор
    Исключение
        // S_ONEC_060 Пустой оператор x1
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Исключение");;			                                //Пустой оператор
    // S_ONEC_060 Пустой оператор x1
    КонецПопытки;;				                                            //Пустой оператор
КонецПроцедуры

//== EmptyOperator.bsl
