Процедура ПроверкаСтиля()

    // S_ONEC_061 Стиль написания ключевых слов x1
    Значение = ложь;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Значение = лОЖь;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Значение = ЛОЖЬ;

    // S_ONEC_061 Стиль написания ключевых слов x1
    // S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
    // S_ONEC_035 Сравнение с булевым литералом x1
    Если Значение <> ложь Тогда
        Обработать();
    // S_ONEC_061 Стиль написания ключевых слов x1
    ИначеЕсли ложь Тогда
        Обработать();
    КонецЕсли;

    // S_ONEC_061 Стиль написания ключевых слов x1
    ПроверитьЗначение(ложь);

КонецПроцедуры
