Procedure ПроверкаСтиля()

    // S_ONEC_061 Стиль написания ключевых слов x1
    Value = false;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Value = fALsE;
    // S_ONEC_061 Стиль написания ключевых слов x1
    Value = FALSE;

    // S_ONEC_061 Стиль написания ключевых слов x1
    // S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
    // S_ONEC_035 Сравнение с булевым литералом x1
    If Value <> false Then
        Обработать();
    // S_ONEC_061 Стиль написания ключевых слов x1
    ElsIf false Then
        Обработать();
    EndIf;

    // S_ONEC_061 Стиль написания ключевых слов x1
    ПроверитьЗначение(false);

EndProcedure
