// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция цикл
    Обработать(Элемент);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 цикл
    Обработать(i);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие цикл
    Обработать();
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция цИКл
    Обработать(Элемент);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 цИКл
    Обработать(i);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие цИКл
    Обработать();
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для Каждого Элемент Из Коллекция ЦИКЛ
    Обработать(Элемент);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Для i = 1 По 10 ЦИКЛ
    Обработать(i);
КонецЦикла;

// S_ONEC_061 Стиль написания ключевых слов x1
Пока Условие ЦИКЛ
    Обработать();
КонецЦикла;
