//-- UnclosedOperator-correctExample.bsl

Процедура Пример()
  Если 1 = 1 Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие выполнено");
  Иначе
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие не выполнено");
КонецЕсли;

  Для Счетчик = 1 По 3 Цикл
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик));
  КонецЦикла;

  Счетчик = 1;
  Пока Счетчик <= 3 Цикл
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик));
    Счетчик = Счетчик + 1;
  КонецЦикла;

  Для Счетчик = 1 По 5 Цикл
    Если Счетчик = 3 Тогда
        Продолжить;
    КонецЕсли;
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик));
  КонецЦикла;

  Для Счетчик = 1 По 5 Цикл
    Если Счетчик = 3 Тогда
        Прервать;
    КонецЕсли;
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик));
  КонецЦикла;
КонецПроцедуры

Процедура Пример2()
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("АА");
КонецПроцедуры

//== UnclosedOperator-correctExample.bsl