//-- UnclosedOperator.bsl

Процедура Пример()
  Если 1 = 1 Тогда
  // S_ONEC_059 Незакрытый оператор x1
  // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие выполнено")					        	//Выражение должно заканчиваться символом ";"
  Иначе
    // S_ONEC_059 Незакрытый оператор x1
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие не выполнено")					    	//Выражение должно заканчиваться символом ";"
КонецЕсли;

  // S_ONEC_059 Незакрытый оператор x1
  Для Счетчик = 1 По 3 Цикл
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик))					//Выражение должно заканчиваться символом ";"
  КонецЦикла;

  Счетчик = 1;
  // S_ONEC_059 Незакрытый оператор x1
  Пока Счетчик <= 3 Цикл
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик));
    Счетчик = Счетчик + 1							            //Выражение должно заканчиваться символом ";"
  КонецЦикла;

  // S_ONEC_059 Незакрытый оператор x1
  Для Счетчик = 1 По 5 Цикл
    Если Счетчик = 3 Тогда
        // S_ONEC_059 Незакрытый оператор x1
        Продолжить								                //Выражение должно заканчиваться символом ";"
    КонецЕсли;
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик))					//Выражение должно заканчиваться символом ";"
  КонецЦикла;

  // S_ONEC_059 Незакрытый оператор x1
  Для Счетчик = 1 По 5 Цикл
    Если Счетчик = 3 Тогда
        // S_ONEC_059 Незакрытый оператор x1
        Прервать								                //Выражение должно заканчиваться символом ";"
    КонецЕсли;
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Итерация: " + Строка(Счетчик))					//Выражение должно заканчиваться символом ";"
  КонецЦикла;
КонецПроцедуры

Процедура Пример2()
    // S_ONEC_059 Незакрытый оператор x1
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("АА")                                              //Выражение должно заканчиваться символом ";"
КонецПроцедуры

//== UnclosedOperator.bsl