//-- UnclosedOperator-lotsOfSemicolons.bsl
Процедура Пример()
// S_ONEC_052 Устаревший метод «Сообщить» x1
// S_ONEC_060 Пустой оператор x3
Сообщить("")
;;;
КонецПроцедуры

Процедура Пример2()
// S_ONEC_060 Пустой оператор x1
// S_ONEC_059 Незакрытый оператор x3
;;;
// S_ONEC_052 Устаревший метод «Сообщить» x1
Сообщить("")
КонецПроцедуры

Процедура Пример3()
// S_ONEC_060 Пустой оператор x3
;;;
// S_ONEC_052 Устаревший метод «Сообщить» x1
Сообщить("")
;;
КонецПроцедуры

//== UnclosedOperator-lotsOfSemicolons.bsl