//-- CurrentDate.bsl

Функция ДатаПроведенияДокумента()
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
	ДатаПроведенияДокумента = ТекущаяДата();
	Возврат ДатаПроведенияДокумента;
КонецФункции


Функция ВремяПокупки()
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
	ВремяПокупки = Формат(ТекущаяДата(), "ДЛФ=T");
	Возврат ВремяПокупки;
КонецФункции


Функция ВремяНачалаСмены()
	ВремяНачалаСмены = Формат(ТекущаяДатаСеанса(), "ДЛФ=T");
	Возврат ВремяНачалаСмены;
КонецФункции


Функция ДатаПроведенияДляДругогоЧасовогоПояса()
    // S_ONEC_044 Использование функции «ТекущаяДата» x1
	ДатаПроведенияДляДругогоЧасовогоПояса = УниверсальноеВремя(ТекущаяДата());
	Возврат ДатаПроведенияДляДругогоЧасовогоПояса;
КонецФункции

//== CurrentDate.bsl