Процедура ПримерПроц1()
    // S_ONEC_061 Стиль написания ключевых слов x1
    возврат;
КонецПроцедуры

Функция ПримерФунк1()
    // S_ONEC_061 Стиль написания ключевых слов x1
    возврат "";
КонецФункции

Процедура ПримерПроц2()
    // S_ONEC_061 Стиль написания ключевых слов x1
    воЗвРАт;
КонецПроцедуры

Функция ПримерФунк2()
    // S_ONEC_061 Стиль написания ключевых слов x1
    воЗвРАт "";
КонецФункции

Процедура ПримерПроц3()
    // S_ONEC_061 Стиль написания ключевых слов x1
    ВОЗВРАТ;
КонецПроцедуры

Функция ПримерФунк3()
    // S_ONEC_061 Стиль написания ключевых слов x1
    ВОЗВРАТ "";
КонецФункции
