//-- PrivilegeDeactivation.bsl
Функция ПроверитьСпособДоставки(Рассылка, Знач ПараметрыДоставки)
	// S_ONEC_003 Некорректная деактивация привилегированного режима x1
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыЖурнала = Новый Структура;
	Рассылка1 = Рассылка;
	Рассылка2 = Рассылка1;

	SetPrivilegedMode(Истина);
	ПараметрыЖурнала.Вставить("ИмяСобытия",   НСтр("ru = 'Рассылка отчетов. Проверка способа доставки'"));
	ПараметрыЖурнала.Вставить("Данные",       Рассылка2);
	ПараметрыЖурнала.Вставить("Метаданные",   Метаданные.Справочники.РассылкиОтчетов);
	ПараметрыЖурнала.Вставить("МассивОшибок", Новый Массив);
	SetPrivilegedMode(Ложь);
КонецФункции

Функция ПроверитьСпособДоставки2(Рассылка, Знач ПараметрыДоставки)
	// Некорректная деактивация привилегированного режима
	// S_ONEC_003 Некорректная деактивация привилегированного режима x1
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыЖурнала = Новый Структура;
	ПараметрыЖурнала.Вставить("МассивОшибок", Новый Массив);
КонецФункции
//== PrivilegeDeactivation.bsl
