Процедура ПрисвоитьИмя()

    // Неочевидный строковый литерал
    Сообщение = "Привет, как дела?";
    ВывестиСообщение(Сообщение);

    // Неочевидный строковый литерал
    ПодСтрока = Сред("Привет, как дела?", 3, 2);

    // Неочевидный строковый литерал
    ВывестиСообщение("Привет, как дела?");
    // Неочевидный строковый литерал
    ВывестиСообщение("Привет , как дела?");
    // Неочевидный строковый литерал
    ВывестиСообщение("Иван Петров", "Привет, как дела?");

КонецПроцедуры


Процедура Конкатенация()
    // Неочевидный строковый литерал
    ПолноеИмя = "Иван Петров";
    ИсходнаяСтрока = "У лукоморья дуб зеленый.
    |Златая цепь на дубе том.
    |И днем и ночью кот ученый...";
    ВывестиСообщение(ПолноеИмя, ИсходнаяСтрока);
КонецПроцедуры


// Неочевидный строковый литерал
Процедура СравнитьСтроки(Имя = "Иван Петров")

    // Неочевидный строковый литерал
    Если ИмяПользователя = "Иван Петров" Тогда
        Обработать();
    КонецЕсли;

КонецПроцедуры
