Процедура ПрисвоитьИмя()

    // S_ONEC_058 Неочевидный строковый литерал x1
    Сообщение = "Привет," " как дела?";
    ВывестиСообщение(Сообщение);

    // S_ONEC_058 Неочевидный строковый литерал x1
    ПодСтрока = Сред("Привет," " как дела?", 3, 2);

    // S_ONEC_058 Неочевидный строковый литерал x1
    ВывестиСообщение("Привет," " как дела?");
    // S_ONEC_058 Неочевидный строковый литерал x1
    ВывестиСообщение("Привет" "," "как" "дела" "?", "Очевидный литерал");
    // S_ONEC_058 Неочевидный строковый литерал x1
    ВывестиСообщение("Иван" "Петров", "Привет," " как дела?");

КонецПроцедуры


Процедура Конкатенация()
    // S_ONEC_058 Неочевидный строковый литерал x1
    ПолноеИмя = "Иван" "Петров" + "играл на рояле";
    // S_ONEC_058 Неочевидный строковый литерал x1
    ПолноеИмя = "Иван" "Петров" + "играл" "на" "рояле";
    ВывестиСообщение(ПолноеИмя);
КонецПроцедуры


// S_ONEC_058 Неочевидный строковый литерал x1
Процедура СравнитьСтроки(Имя = "Иван" "Петров")

    // S_ONEC_058 Неочевидный строковый литерал x1
    Если ИмяПользователя = "Иван" "Петров" Тогда
        Обработать();
    КонецЕсли;

КонецПроцедуры
