// S_ONEC_061 Стиль написания ключевых слов x1
асинх Функция ПримерФункции()
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
асинх Процедура ПримерПроцедуры()
    Возврат;
КонецПроцедуры


// S_ONEC_061 Стиль написания ключевых слов x1
аСиНх Функция ПримерФункции()
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
аСиНх Процедура ПримерПроцедуры()
    Возврат;
КонецПроцедуры


// S_ONEC_061 Стиль написания ключевых слов x1
АСИНХ Функция ПримерФункции()
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
АСИНХ Процедура ПримерПроцедуры()
    Возврат;
КонецПроцедуры
