// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(знач Пар)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(знач Пар)
    Возврат;
КонецПроцедуры

// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(знач Пар1, Пар2)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(знач Пар1, Пар2)
    Возврат;
КонецПроцедуры

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(знач Пар1, знач Пар2)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(знач Пар1, знач Пар2)
    Возврат;
КонецПроцедуры


// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(зНаЧ Пар)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(зНаЧ Пар)
    Возврат;
КонецПроцедуры

// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(зНаЧ Пар1, Пар2)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(зНаЧ Пар1, Пар2)
    Возврат;
КонецПроцедуры

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(зНаЧ Пар1, зНаЧ Пар2)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(зНаЧ Пар1, зНаЧ Пар2)
    Возврат;
КонецПроцедуры


// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(ЗНАЧ Пар)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(ЗНАЧ Пар)
    Возврат;
КонецПроцедуры

// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(ЗНАЧ Пар1, Пар2)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(ЗНАЧ Пар1, Пар2)
    Возврат;
КонецПроцедуры

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Функция ПримерФункции(ЗНАЧ Пар1, ЗНАЧ Пар2)
    Возврат "";
КонецФункции

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_061 Стиль написания ключевых слов x1
Процедура ПримерПроцедуры(ЗНАЧ Пар1, ЗНАЧ Пар2)
    Возврат;
КонецПроцедуры
