// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
Если Истина тогда
    Обработать();
// S_ONEC_061 Стиль написания ключевых слов x1
ИначеЕсли Ложь тогда
    Обработать();
КонецЕсли;

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
Если Истина тоГДа
    Обработать();
// S_ONEC_061 Стиль написания ключевых слов x1
ИначеЕсли Ложь тоГДа
    Обработать();
КонецЕсли;

// S_ONEC_061 Стиль написания ключевых слов x1
// S_ONEC_054 Отсутствие конструкции «Иначе» в условном операторе x1
Если Истина ТОГДА
    Обработать();
// S_ONEC_061 Стиль написания ключевых слов x1
ИначеЕсли Ложь ТОГДА
    Обработать();
КонецЕсли;
