&НаКлиенте
Процедура ЗапуститьОбработку(Команда)
    // S_ONEC_026 Запуск внешнего отчета x1
    ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьКФайлу);
    ВнешняяОбработка.ПолучитьФорму().Открыть();

    // S_ONEC_026 Запуск внешнего отчета x1
    ВнешнийОтчет = ВнешниеОтчеты.Создать(ПолноеИмяФайла);
    ВнешнийОтчет.ПолучитьФорму().Открыть();

    // S_ONEC_026 Запуск внешнего отчета x1
    // S_ONEC_047 Небезопасный режим запуска внешнего отчета или обработки x1
    ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьКФайлу, Ложь);
    ВнешняяОбработка.ПолучитьФорму().Открыть();

    // S_ONEC_026 Запуск внешнего отчета x1
    // S_ONEC_047 Небезопасный режим запуска внешнего отчета или обработки x1
    ВнешнийОтчет = ВнешниеОтчеты.Создать(ПолноеИмяФайла, Ложь);
    ВнешнийОтчет.ПолучитьФорму().Открыть();
КонецПроцедуры

&НаСервере
Функция ПодключитьВнешнююОбработку(АдресХранилища)
    // S_ONEC_026 Запуск внешнего отчета x1
	Возврат ВнешниеОбработки.Подключить(АдресХранилища);
КонецФункции

&НаСервере
Функция ПодключитьВнешнийОтчет(АдресХранилища)
    // S_ONEC_026 Запуск внешнего отчета x1
	Возврат ВнешниеОтчеты.Подключить(АдресХранилища);
КонецФункции

&НаСервере
Функция НебезопасноПодключитьВнешнююОбработку(АдресХранилища)
    // S_ONEC_026 Запуск внешнего отчета x1
    // S_ONEC_047 Небезопасный режим запуска внешнего отчета или обработки x1
	Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
КонецФункции

&НаСервере
Функция НебезопасноПодключитьВнешнийОтчет(АдресХранилища, Имя)
    // S_ONEC_026 Запуск внешнего отчета x1
    // S_ONEC_047 Небезопасный режим запуска внешнего отчета или обработки x1
	Возврат ВнешниеОтчеты.Подключить(АдресХранилища, Имя, Ложь);
КонецФункции
