//-- UnsafeMode.bsl
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСпособДоставки(Рассылка, Знач ПараметрыДоставки) Экспорт
    // S_ONEC_048 Отключение безопасного режима x1
    УстановитьБезопасныйРежим(Ложь);
        Попытка
            ShellApplication.SetTime();
        Исключение
            ПараметрыЖурнала.Вставить("Данные",  Рассылка);
        КонецПопытки;
        // S_ONEC_061 Стиль написания ключевых слов x1
        возврат ПараметрыЖурнала;
    УстановитьБезопасныйРежим(Истина);


    // S_ONEC_061 Стиль написания ключевых слов x1
    Для НазваниеПерем = СчетчНачало по СчетчКонец Цикл
        Если 1 < 0 Тогда
        // S_ONEC_048 Отключение безопасного режима x1
            УстановитьОтключениеБезопасногоРежима(Истина);
        // S_ONEC_061 Стиль написания ключевых слов x1
            УстановитьОтключениеБезопасногоРежима(ложь);
        Иначе
        // S_ONEC_061 Стиль написания ключевых слов x1
            Для н = 1 по 100 Цикл
                // S_ONEC_048 Отключение безопасного режима x1
                SetDisableSafeMode(True);
                // S_ONEC_052 Устаревший метод «Сообщить» x1
                Сообщить("Команда выполняется в небезопасном режиме !");
                SetDisableSafeMode(False);
            КонецЦикла;
                // S_ONEC_048 Отключение безопасного режима x1
                // Некорректная деактивация
                SetSafeMode(Ложь);
                // S_ONEC_052 Устаревший метод «Сообщить» x1
                Сообщить("Команда выполняется в небезопасном режиме !");
        КонецЕсли;

        // S_ONEC_048 Отключение безопасного режима x1
        // Некорректная деактивация
        УстановитьОтключениеБезопасногоРежима(Истина);
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Команда выполняется в небезопасном режиме !");
    КонецЦикла;
КонецФункции
//== UnsafeMode.bsl
