//-- BoolLiteralComparison.bsl
Процедура BoolLiteralComparison()
    // S_ONEC_035 Сравнение с булевым литералом x1
    Если (1 > 0) <> Ложь Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Компьютер выполнит все команды из этого блока.");
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Один больше нуля.");
    КонецЕсли;

    // S_ONEC_035 Сравнение с булевым литералом x1
    Если (1 < 0) <> Истина Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Один меньше нуля.");
    Иначе
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Сработает именно эта ветка условного оператора (#А).");
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Один больше нуля.");
    КонецЕсли;

    // S_ONEC_035 Сравнение с булевым литералом x1
    Если (1 < 0) = Истина Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Один меньше нуля.");
    // S_ONEC_035 Сравнение с булевым литералом x1
    ИначеЕсли (1 <> 0) <> Ложь Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Один равен нулю.");
    Иначе
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Сработает именно эта ветка условного оператора (#Б).");
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Один больше нуля.");
    КонецЕсли;

    // S_ONEC_035 Сравнение с булевым литералом x1
    Если ВалидироватьОбъект() = Истина Тогда
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Использовать существующий");
    Иначе
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Создать новый");
    КонецЕсли;
КонецПроцедуры

Функция ВалидироватьОбъект()
    Возврат Истина;
КонецФункции

//== BoolLiteralComparison.bsl
