//-- GotoStatement.bsl
Процедура GotoStatement(ТаблицаЗначенийПроценты)
// S_ONEC_059 Незакрытый оператор x1
    Если ТаблицаЗначенийПроценты = Неопределено Тогда
        // S_ONEC_034 Оператор «Перейти» x1
        Перейти ~УпрощенныйРасчет;
    КонецЕсли;

    // S_ONEC_034 Оператор «Перейти» x1
    Перейти ~ИдентификаторМетки;
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Неисполняемый фрагмент кода");
    ~ИдентификаторМетки:

    // S_ONEC_034 Оператор «Перейти» x1
    Goto ~Label;
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Неисполняемый фрагмент кода");
    ~Label:

    Пока Истина Цикл
        // S_ONEC_034 Оператор «Перейти» x1
        Перейти ~КонецЦикла;
        // S_ONEC_052 Устаревший метод «Сообщить» x1
        Сообщить("Неисполняемый фрагмент кода");
    КонецЦикла;
    ~КонецЦикла:
    ~УпрощенныйРасчет:
КонецПроцедуры

//== GotoStatement.bsl
