Если Истина Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие выполнено");
// S_ONEC_061 Стиль написания ключевых слов x1
иначе
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Ни одно из условий не выполнено");
КонецЕсли;

Если Истина Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие выполнено");
// S_ONEC_061 Стиль написания ключевых слов x1
иНАчЕ
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Ни одно из условий не выполнено");
КонецЕсли;

Если Истина Тогда
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Условие выполнено");
// S_ONEC_061 Стиль написания ключевых слов x1
ИНАЧЕ
    // S_ONEC_052 Устаревший метод «Сообщить» x1
    Сообщить("Ни одно из условий не выполнено");
КонецЕсли;
